# GridEndSegmentWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridEndSegmentWeight Property
ParameterTypeId Class See Also
---
"End Segment Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridEndSegmentWeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridEndSegmentWeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridEndSegmentWeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace